InformationRegisters/СеткаОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>СеткаОстатков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СеткаОстатков/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура НоменклатурнаяГруппаПриИзменении(Элемент)
	
	ОтобразитьНаСервере(); 	
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьНаСервере()
	
	ТабДок.Очистить();
	
	Макет = РегистрыСведений.СеткаОстатков.ПолучитьМакет("Макет");
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СеткаОстатков.НоменклатурнаяГруппа,
	|	СеткаОстатков.Длина,
	|	СеткаОстатков.Ширина,
	|	СеткаОстатков.Использовать
	|ИЗ
	|	РегистрСведений.СеткаОстатков КАК СеткаОстатков
	|ГДЕ
	|	СеткаОстатков.НоменклатурнаяГруппа = &НоменклатурнаяГруппа";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Положение = "" + СтрЗаменить(Выборка.Ширина, Символы.НПП, "") + "_" + СтрЗаменить(Выборка.Длина, Символы.НПП, "");
		Параметр = "п" + Положение;
		Расшифровка = "р" + Положение;
		ОбластьТело.Параметры[Параметр] = Выборка.Использовать;
		ОбластьТело.Параметры[Расшифровка] = Новый Структура("Длина, Ширина, Использовать", Выборка.Длина, Выборка.Ширина, НЕ Выборка.Использовать);
		
	КонецЦикла;	
	
	ТабДок.Вывести(ОбластьТело);
	 
КонецПроцедуры

&НаКлиенте
Процедура ТабДокОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	РасшифровкаНаСервере(Расшифровка);
		
КонецПроцедуры

&НаСервере
Процедура РасшифровкаНаСервере(Расшифровка)
	
	
	НаборЗаписей = РегистрыСведений.СеткаОстатков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.НоменклатурнаяГруппа.Установить(НоменклатурнаяГруппа);
	НаборЗаписей.Отбор.Длина.Установить(Расшифровка.Длина);
	НаборЗаписей.Отбор.Ширина.Установить(Расшифровка.Ширина);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда                  
		Запись = НаборЗаписей.Добавить();
	Иначе
		Запись = НаборЗаписей[0];
	КонецЕсли;                                              
	
	Запись.Использовать = Расшифровка.Использовать;
	Запись.Длина = Расшифровка.Длина;
	Запись.Ширина = Расшифровка.Ширина;
	Запись.НоменклатурнаяГруппа = НоменклатурнаяГруппа;
	
	НаборЗаписей.Записать();
	
	ОтобразитьНаСервере();
	 
КонецПроцедуры
